#include <iostream>

void min_odd_digit(long long n, int &mn, int &pos_mn) {
    mn = -1;
    pos_mn = -1;
    n = llabs(n);

    long long t = n; // Переменная промежуточного хранения
    int len = 0; // Переменная длины числа
    while (t > 0) {
        len++;
        t /= 10;
    }

    int pos_from_right = 1; // Переменная позиции справа
    while (n > 0) {
        int d = n % 10; // Переменная цифры числа

        if (d % 2 == 1) { // Проверка на нечётность
            int left_pos = len - pos_from_right + 1; // Переменная позиции слева
            // Проверка на манимальное число (минимальной ещё нет или цифра меньше минимальной или цифра равна минимальной, но разряд старше)
            if (mn == -1 || d < mn || (d == mn && left_pos < pos_mn)) {
                mn = d;
                pos_mn = left_pos;
            }
        }
        n /= 10;
        pos_from_right++;
    }
}

int main() {
    long long n; // Переменная для хранения числа которое введёт пользователь
    int mn, pos_mn = 0;

    std::cout << "Введите число: ";
    std::cin >> n;

    min_odd_digit(n, mn, pos_mn);

    if (pos_mn != -1) {
        std::cout <<"Минимальная нечётная цифра числа: " << mn << " 🥸, " << "Её позиция в числе: " << pos_mn << " 🤩." << std::endl;
    }
    else std::cout << "Наименьшей нечётной цифры не нашлось😭";
    return 0;
}