#include <iostream>

void gen(int n, int max, int used) {
    static int comb[20];

    if (n == 0) {
        for (int i = 0; i < used; i++) {
            if (i > 0) std::cout << '+';
            std::cout << comb[i];
        }
        std::cout << '\n';
        return;
    }

    for (int x = (max < n ? max : n); x >= 1; x--) {
        comb[used] = x;
        gen(n - x, x, used + 1);
    }
}

int main() {
    int n;
    std::cout << R"(✨ Д Р У Ж О К ✨
Введи-ка число от 2 до 20, солнышко! 🌟
Не подведи меня, ладно? 💖

👉 Вот примерчик: `13`)" << std::endl;
    std::cin >> n;
    while (n < 2 || n > 20) {
        std::cout << R"(🚫 Не, это не число.
🧠 Введи цифры, а не иероглифы из своей головы.
📝 Пример: `7`
)";
        std::cin >> n;
    }
    std::cout << R"(⚡ ВВЕДЕНО: )" << n << R"(
🔥 ДОСТУПНЫЕ СУММЫ-ЛЕСЕНКИ:
)";
    gen(n, n, 0);

    std::cout << "💀 ЭТО ВСЁ, ЧТО МОЖНО ВЫЖАТЬ ИЗ ЭТОГО ЧИСЛА.";
    return 0;
}