#include <iostream>

void gen(int n, int max, bool first) {
    if (n == 0) {
        std::cout << '\n';
        return;
    }

    for (int x = (max < n ? max : n); x >= 1; --x) {

        if (!first) std::cout << "+";
        std::cout << x;

        gen(n - x, x, false);

        std::cout << "\b";

    }
}

int main() {
    int n; // Переменная для хранения числа, которое введёт пользователь
    std::cout << R"(✨ Д Р У Ж О К ✨
Введи-ка число от 2 до 20, солнышко! 🌟
Не подведи меня, ладно? 💖

👉 Вот примерчик: `13`)" << std::endl;
    std::cin >> n;
    while (n < 2 || n > 20) std::cin >> n;
    std::cout << R"(⚡ ВВЕДЕНО: )" << n << R"(
🔥 ДОСТУПНЫЕ СУММЫ-ЛЕСЕНКИ:
)";

    gen(n, n, true);
    std::cout << "💀 ЭТО ВСЁ, ЧТО МОЖНО ВЫЖАТЬ ИЗ ЭТОГО ЧИСЛА.";
    return 0;
}
