#include <iostream>

long long n; // Переменная для хранения числа которое введёт пользователь
int m; // Переменная для хранения количеста кубов которыми можно представить n
bool found = false;
bool first = true;

void agony(long long ost, int cube_used, int max_k) {
    if (found) return;
    if (cube_used > m) return;

    if (ost == 0) {
        found = true;
        std::cout << "Чиселко 1 можно представить как сумму кубов🤯: ";
        return;
    }

    for (long long i = max_k; i >= 1; i--) {
        long long cube = i*i*i;

        if (cube <= ost) {
            agony(ost - cube, cube_used + 1, i);
        }

        if (found) {
            if (!first) std::cout << " + ";

            std::cout << i;
            first = false;
            return;
        }
    }
}

int main() {
    std::cout << "🔢Введите через пробел 2 чиселка. Первое число — от 2 до 2 000 000 000 (да, вот такой прекрасный  разброс 🧠💥). Второе от 1 до 10 (можно посчитать на пальцах 👐🔟): " << std::endl;;
    std::cin >> n >> m;
    while (n < 2 || m < 1 || m > 10 || n > 2000000000) {
        std::cout << R"(🚫 Не, это не число.
🧠 Введи цифры, а не иероглифы из своей головы.
📝 Пример: `7`
)";
        std::cin >> n;
    }

    long long max_k = 1;
    while ((max_k + 1) * (max_k + 1) * (max_k + 1) <= n)
        max_k++;

    agony(n, 0, max_k);

    if (!found)
        std::cout << "Чиселко нельзя представить в виде суммы кубов — значит, оно бесполезное, и ему прямая дорога в мусорку. 🗑️💩";

    return 0;
}
